espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin-soc/mac-address-filtering/mac-address-filtering.c
static void clearStatsForFilterType(MacFilterType type)
{
  uint8_t i;
  macAddressFilterData.allowedPacketCount[type] = 0;
  macAddressFilterData.droppedPacketCount[type] = 0;

  if (type == MAC_FILTER_TYPE_SHORT_ADDRESS) {
    for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH; i++) {
      macAddressFilterData.macShortAddressList[i].matchCount = 0;
    }
  } else if (type == MAC_FILTER_TYPE_LONG_ADDRESS) {
    for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_LONG_ADDRESS_FILTER_LENGTH; i++) {
      macAddressFilterData.macLongAddressList[i].matchCount = 0;
    }
  } else if (type == MAC_FILTER_TYPE_PAN_ID) {
    for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_PAN_ID_FILTER_LENGTH; i++) {
      macAddressFilterData.panIdFilterMatchList[i].matchCount = 0;
    }
  }
}

static void clearShortFilterList(void)
{
  // We need to set the short address list to be EMBER_NULL_NODE_ID by default
  // (0xFFFF) because 0x0000 is a valid address.  Thus our MEMSET() to 0 for
  // the global struct is not good enough.
  // We can't use MEMSET() because the ShortAddressFilterMatchStruct contains
  // a count variable that should be set to 0.
  uint8_t i;
  for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH; i++) {
    macAddressFilterData.macShortAddressList[i].shortAddress
      = EMBER_NULL_NODE_ID;
  }
  clearStatsForFilterType(MAC_FILTER_TYPE_SHORT_ADDRESS);
}

static void clearLongFilterlist(void)
{
  MEMSET(macAddressFilterData.macLongAddressList,
         0,
         sizeof(LongAddressFilterMatchStruct)
         * EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_LONG_ADDRESS_FILTER_LENGTH);
}

static void clearPanIdFilterList(void)
{
  MEMSET(macAddressFilterData.panIdFilterMatchList,
         0xFF,
         sizeof(PanIdFilterMatchStruct)
         * EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_PAN_ID_FILTER_LENGTH);
}

// *****************************************************************************
// Public Functions

EmberPacketAction emberAfIncomingPacketFilterCallback(EmberZigbeePacketType packetType,
                                                      uint8_t* packetData,
                                                      uint8_t* size_p,
                                                      void *data)
{
  FilterResult result;
  if (packetType != EMBER_ZIGBEE_PACKET_TYPE_RAW_MAC) {
    expectCheckpoint("Ignoring non-matching callback type.");
    return EMBER_ACCEPT_PACKET;
  }

  macAddressFilterData.totalPackets++;

  // @TODO figure decide on how to deal with index being 0
  result = parseAndMaybeFilterPacket(packetData, 0);
  if (result == DROP_PACKET) {
    return EMBER_DROP_PACKET;
  } else {
    return EMBER_ACCEPT_PACKET;
  }
}

void emberAfPluginMacAddressFilteringInitCallback(SLXU_INIT_ARG)
{
  SLXU_INIT_UNUSED_ARG;

  MEMSET(&macAddressFilterData, 0, sizeof(MacAddressFilterGlobals));
  macAddressFilterData.options = MAC_FILTER_OPTIONS_DEFAULTS;
  clearShortFilterList();
  clearLongFilterlist();
  clearPanIdFilterList();
}

// <generate-cli-xml> Plugin CLI Description: Commands to manipulate the MAC address filtering tables.

// <generate-cli-xml> Command: plugin mac-address-filtering set-config no-address-filter <enable>
// <generate-cli-xml> Description: Enable/disable filtering of no-address messages.
// <generate-cli-xml> Arg: enable | bool | True means drop no-address messages, false means allow.

void emberAfPluginMacAddressFilteringFilterNoAddressCommand(SL_CLI_COMMAND_ARG)
{
  bool filterNoAddress = (bool)emberUnsignedCommandArgument(0);

  if (filterNoAddress) {
    macAddressFilterData.options &= ~MAC_FILTER_OPTIONS_ALLOW_NO_ADDRESS;
  } else {
    macAddressFilterData.options |= MAC_FILTER_OPTIONS_ALLOW_NO_ADDRESS;
  }
}

// <generate-cli-xml> Command: plugin mac-address-filtering print-config
// <generate-cli-xml> Description: Prints the current filtering config and statistics.

void emberAfPluginMacAddressFilteringPrintConfigCommand(SL_CLI_COMMAND_ARG)
{
  uint8_t i;
  emberAfCorePrintln("Total MAC Packets received: %lu", macAddressFilterData.totalPackets);
  emberAfCorePrintln("Options bitmask: 0x%X", macAddressFilterData.options);
  for ( i = 0; i < MAC_FILTER_OPTIONS_COUNT; i++ ) {
    const char* enabledDisabledTextPointer = ( (macAddressFilterData.options & optionsDescription[i].bit)
                                               ? optionsDescription[i].enabledDescription
                                               : optionsDescription[i].disabledDescription);
    emberAfCorePrintln("%s: %s  Packets Accepted %lu, Dropped: %lu",
                       optionsDescription[i].optionName,
                       enabledDisabledTextPointer,
                       macAddressFilterData.allowedPacketCount[i],
                       macAddressFilterData.droppedPacketCount[i]);
  }

  emberAfCorePrintln("Short Address Filter List");

  for ( i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH; i++ ) {
    emberAfCorePrint("%d: ", i);
    if (macAddressFilterData.macShortAddressList[i].shortAddress
        == EMBER_NULL_NODE_ID) {
      emberAfCorePrintln("---");
    } else {
      emberAfCorePrintln("0x%2X  Match Count: %lu",
                         macAddressFilterData.macShortAddressList[i].shortAddress,
                         macAddressFilterData.macShortAddressList[i].matchCount);
    }
  }

  emberAfCorePrintln("\nLong Address Filter List");

  for ( i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_LONG_ADDRESS_FILTER_LENGTH; i++ ) {
    emberAfCorePrint("%d: ", i);
    if (0 == MEMCOMPARE(macAddressFilterData.macLongAddressList[i].longAddress,
                        zeroEui64,
                        EUI64_SIZE)) {
      emberAfCorePrintln("---");
    } else {
      emberAfPrintBigEndianEui64(macAddressFilterData.macLongAddressList[i].longAddress);
      emberAfCorePrintln("  Match Count: %lu",
                         macAddressFilterData.macLongAddressList[i].matchCount);
    }
  }
}

// <generate-cli-xml> Command: plugin mac-address-filtering short-address-list add <node-id>
// <generate-cli-xml> Description: Adds an address to the short address list.
// <generate-cli-xml> Arg: node-id | EmberNodeId | The node-id to add to the short list.

void emberAfPluginMacAddressFilteringAddShortAddressCommand(SL_CLI_COMMAND_ARG)
{
  EmberNodeId nodeId = (uint16_t)emberUnsignedCommandArgument(0);
  uint8_t i = 0;
  for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH; i++) {
    if (EMBER_NULL_NODE_ID
        == macAddressFilterData.macShortAddressList[i].shortAddress) {
      macAddressFilterData.macShortAddressList[i].shortAddress = nodeId;
      macAddressFilterData.macShortAddressList[i].matchCount = 0;
      emberAfCorePrintln("Added short address to list.");
      return;
    }
  }

