espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin-soc/mac-address-filtering/mac-address-filtering.c
  emberAfCorePrintln("Error: No free entries in the short list.");
}

#define WHITELIST_CHARACTER_INDEX 4

#ifdef UC_BUILD
static void changeListConfig(bool currentConfigIsWhitelist,
                             MacFilterType type,
                             MacAddressFilterOptions valueForWhitelist,
                             sl_cli_command_arg_t *arguments)
#else
static void changeListConfig(bool currentConfigIsWhitelist,
                             MacFilterType type,
                             MacAddressFilterOptions valueForWhitelist)
#endif // UC_BUILD
{
  bool changeToWhitelist = false;
  uint8_t* pointer
    = emberStringCommandArgument(-1,   // argument number
                                 NULL); // returned length

  if (pointer[WHITELIST_CHARACTER_INDEX] == 'w') {
    changeToWhitelist = true;
  }

  if ((changeToWhitelist && !currentConfigIsWhitelist)
      || (!changeToWhitelist && currentConfigIsWhitelist)) {
    // If we are setting the list to the opposite of its current value,
    // clear the stats for that item.  Otherwise don't.
    // Prevents a problem where accidentally setting the list type
    // to the same thing clears the stats when that doesn't seem
    // like what the user wants.
    clearStatsForFilterType(type);
    emberAfCorePrintln("Cleared dropped packet count for list.");
  }

  if (changeToWhitelist) {
    macAddressFilterData.options |= valueForWhitelist;
  } else {
    macAddressFilterData.options &= ~valueForWhitelist;
  }

  emberAfCorePrintln("%s list changed to %slist.\n",
                     ((type == MAC_FILTER_TYPE_SHORT_ADDRESS)
                      ? "Short address"
                      : ((type == MAC_FILTER_TYPE_LONG_ADDRESS)
                         ? "Long address"
                         : ((type == MAC_FILTER_TYPE_PAN_ID)
                            ? "PAN ID"
                            : "No Address"))),
                     (changeToWhitelist
                      ? "white"
                      : "black"));
}

// <generate-cli-xml> Command: plugin mac-address-filtering short-address-list set-whitelist
// <generate-cli-xml> Description:  Sets the short address list filter to a whitelist.

// NOTE 1:
//   A bit of hack to make the generate-cli-xml.pl script happy.
//   Since the same function can make the short list a white or black-list
//   we don't need two actual C functions.  But the script wants
//   to parse the next C function line as the command to be executed.
//   Just add a forward declaration and all is well.
void emberAfPluginMacAddressFilteringSetShortAddressListType(SL_CLI_COMMAND_ARG);

// <generate-cli-xml> Command: plugin mac-address-filtering short-address-list set-blacklist
// <generate-cli-xml> Description:  Sets the short address list filter to a blacklist.

void emberAfPluginMacAddressFilteringSetShortAddressListType(SL_CLI_COMMAND_ARG)
{
#ifdef UC_BUILD
  changeListConfig((macAddressFilterData.options
                    & MAC_FILTER_OPTIONS_SHORT_ADDRESS_WHITELIST),
                   MAC_FILTER_TYPE_SHORT_ADDRESS,
                   MAC_FILTER_OPTIONS_SHORT_ADDRESS_WHITELIST,
                   arguments);
#else
  changeListConfig((macAddressFilterData.options
                    & MAC_FILTER_OPTIONS_SHORT_ADDRESS_WHITELIST),
                   MAC_FILTER_TYPE_SHORT_ADDRESS,
                   MAC_FILTER_OPTIONS_SHORT_ADDRESS_WHITELIST);
#endif // UC_BUILD
}

// <generate-cli-xml> Command: plugin mac-address-filtering long-address-list set-whitelist
// <generate-cli-xml> Description: Sets the long address list filter to a whitelist.

// NOTE 2:  Forward declaration on purpose.  See Note 1 above.
void emberAfPluginMacAddressFilteringSetLongAddressListType(SL_CLI_COMMAND_ARG);

// <generate-cli-xml> Command: plugin mac-address-filtering long-address-list set-blacklist
// <generate-cli-xml> Description: Sets the long address list filter to a blacklist.

void emberAfPluginMacAddressFilteringSetLongAddressListType(SL_CLI_COMMAND_ARG)
{
#ifdef UC_BUILD
  changeListConfig((macAddressFilterData.options
                    & MAC_FILTER_OPTIONS_LONG_ADDRESS_WHITELIST),
                   MAC_FILTER_TYPE_LONG_ADDRESS,
                   MAC_FILTER_OPTIONS_LONG_ADDRESS_WHITELIST,
                   arguments);
#else
  changeListConfig((macAddressFilterData.options
                    & MAC_FILTER_OPTIONS_LONG_ADDRESS_WHITELIST),
                   MAC_FILTER_TYPE_LONG_ADDRESS,
                   MAC_FILTER_OPTIONS_LONG_ADDRESS_WHITELIST);
#endif // UC_BUILD
}

// <generate-cli-xml> Command: plugin mac-address-filtering long-address-list add <eui64>
// <generate-cli-xml> Description: Adds a long address to the long address filter.
// <generate-cli-xml> Arg: eui64 | EmberEUI64 | The long address to add.

void emberAfPluginMacAddressFilteringAddLongAddressCommand(SL_CLI_COMMAND_ARG)
{
  uint8_t i;
  EmberEUI64 eui64;
  emberCopyBigEndianEui64Argument(0, eui64);
  for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_LONG_ADDRESS_FILTER_LENGTH; i++) {
    if (0 == MEMCOMPARE(macAddressFilterData.macLongAddressList[i].longAddress,
                        zeroEui64,
                        EUI64_SIZE)) {
      MEMCOPY(macAddressFilterData.macLongAddressList[i].longAddress,
              eui64,
              EUI64_SIZE);
      macAddressFilterData.macLongAddressList[i].matchCount = 0;
      return;
    }
  }

  emberAfCorePrintln("Error: No free entries in the long list.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering short-address-list clear
// <generate-cli-xml> Description: Clears the short address list filter.

void emberAfPluginMacAddressFilteringClearShortAddressList(SL_CLI_COMMAND_ARG)
{
  clearShortFilterList();
  emberAfCorePrintln("Short address list cleared.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering long-address-list clear
// <generate-cli-xml> Description: Clears the long address list filter.

void emberAfPluginMacAddressFilteringClearLongAddressList(SL_CLI_COMMAND_ARG)
{
  clearLongFilterlist();
  emberAfCorePrintln("Long address list cleared.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering pan-id-list add <pan-id>
// <generate-cli-xml> Description: Adds a PAN ID to the filter.
// <generate-cli-xml> Arg: pan-id | uint16_t | The PAN ID to add to the list.

void emberAfPluginMacAddressFilteringAddPanIdCommand(SL_CLI_COMMAND_ARG)
{
  EmberPanId panId = (EmberPanId)emberUnsignedCommandArgument(0);
  uint8_t i = 0;
  for (i = 0; i < EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_PAN_ID_FILTER_LENGTH; i++) {
    if (BROADCAST_PAN_ID
        == macAddressFilterData.panIdFilterMatchList[i].panId) {
      macAddressFilterData.panIdFilterMatchList[i].panId = panId;
      macAddressFilterData.panIdFilterMatchList[i].matchCount = 0;
      emberAfCorePrintln("Added PAN ID to list.");
      return;
    }
  }

  emberAfCorePrintln("Error: No free entries in the PAN ID list.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering pan-id-list delete <index>
// <generate-cli-xml> Description: Deletes an entry in the PAN ID list filter.
// <generate-cli-xml> Arg: index | uint8_t | The index of the entry to delete.

