espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin-soc/mac-address-filtering/mac-address-filtering.c
void emberAfPluginMacAddressFilteringPanIdDeleteEntry(SL_CLI_COMMAND_ARG)
{
  uint8_t index = emberUnsignedCommandArgument(0);
  if (index >= EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_PAN_ID_FILTER_LENGTH) {
    emberAfCorePrintln("Error: Index is greater than or equal to list length (%d)",
                       EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_PAN_ID_FILTER_LENGTH);
    return;
  }

  macAddressFilterData.panIdFilterMatchList[index].panId = BROADCAST_PAN_ID;
  emberAfCorePrintln("Entry deleted.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering pan-id-list clear
// <generate-cli-xml> Description: Clears the PAN ID list filter.

void emberAfPluginMacAddressFilteringClearPanIdList(SL_CLI_COMMAND_ARG)
{
  clearPanIdFilterList();
}

// <generate-cli-xml> Command: plugin mac-address-filtering pan-id-list set-whitelist
// <generate-cli-xml> Description:  Sets the PAN-ID list filter to a whitelist.

// NOTE 3: See Note 1 as to why we have a forward declaration here.
void emberAfPluginMacAddressFilteringSetPanIdListType(SL_CLI_COMMAND_ARG);

// <generate-cli-xml> Command: plugin mac-address-filtering pan-id-list set-blacklist
// <generate-cli-xml> Description:  Sets the PAN_ID list filter to a blacklist.

void emberAfPluginMacAddressFilteringSetPanIdListType(SL_CLI_COMMAND_ARG)
{
#ifdef UC_BUILD
  changeListConfig(macAddressFilterData.options & MAC_FILTER_OPTIONS_DEST_PAN_ID_WHITELIST,
                   MAC_FILTER_TYPE_PAN_ID,
                   MAC_FILTER_OPTIONS_DEST_PAN_ID_WHITELIST,
                   arguments);
#else
  changeListConfig(macAddressFilterData.options & MAC_FILTER_OPTIONS_DEST_PAN_ID_WHITELIST,
                   MAC_FILTER_TYPE_PAN_ID,
                   MAC_FILTER_OPTIONS_DEST_PAN_ID_WHITELIST);
#endif // UC_BUILD
}

// <generate-cli-xml> Command: plugin mac-address-filtering reset
// <generate-cli-xml> Description: Resets the state of the plugin to the default of no filtering.

void emberAfPluginMacAddressFilteringReset(SL_CLI_COMMAND_ARG)
{
#ifdef UC_BUILD
  // TODO: update once we port the init callback
  emberAfPluginMacAddressFilteringInitCallback(SL_ZIGBEE_INIT_LEVEL_LOCAL_DATA);
#else // !UC_BUILD
  emberAfPluginMacAddressFilteringInitCallback();
#endif // UC_BUILD
  emberAfCorePrintln("All filter data cleared.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering short-address-list delete <index>
// <generate-cli-xml> Description: Deletes an entry in the short address list filter.
// <generate-cli-xml> Arg: index | uint8_t | The index of the entry to delete.

void emberAfPluginMacAddressFilteringShortAddressDeleteEntry(SL_CLI_COMMAND_ARG)
{
  uint8_t index = emberUnsignedCommandArgument(0);
  if (index >= EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH) {
    emberAfCorePrintln("Error: Index is greater than or equal to list length (%d)",
                       EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH);
    return;
  }

  macAddressFilterData.macShortAddressList[index].shortAddress = EMBER_NULL_NODE_ID;
  emberAfCorePrintln("Entry deleted.");
}

// <generate-cli-xml> Command: plugin mac-address-filtering long-address-list delete <index>
// <generate-cli-xml> Description: Deletes an entry in the long address list filter.
// <generate-cli-xml> Arg: index | uint8_t | The entry in the long address list to delete.

void emberAfPluginMacAddressFilteringLongAddressDeleteEntry(SL_CLI_COMMAND_ARG)
{
  uint8_t index = emberUnsignedCommandArgument(0);
  if (index >= EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_LONG_ADDRESS_FILTER_LENGTH) {
    emberAfCorePrintln("Error: Index is greater than or equal to list length (%d)",
                       EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_LONG_ADDRESS_FILTER_LENGTH);
    return;
  }

  MEMSET(macAddressFilterData.macLongAddressList[index].longAddress,
         0,
         EUI64_SIZE);
  emberAfCorePrintln("Entry deleted.");
}

EmberStatus emberAfPluginMacAddressFilteringGetStatsForShortAddress(uint8_t index,
                                                                    uint32_t* matchCountForIndexPtr)
{
  if (index >= EMBER_AF_PLUGIN_MAC_ADDRESS_FILTERING_SHORT_ADDRESS_FILTER_LENGTH) {
    return EMBER_BAD_ARGUMENT;
  }

  *matchCountForIndexPtr = macAddressFilterData.macShortAddressList[index].matchCount;

  return EMBER_SUCCESS;
}

void emberAfPluginMacAddressFilteringGetStats(bool shortMode,
                                              uint32_t* allowedPacketCountPtr,
                                              uint32_t* droppedPacketCountPtr,
                                              uint32_t* totalPacketCountPtr)
{
  MacAddressMode mode = (shortMode
                         ? MAC_ADDRESS_MODE_SHORT
                         : MAC_ADDRESS_MODE_LONG);

  *allowedPacketCountPtr = macAddressFilterData.allowedPacketCount[mode];
  *droppedPacketCountPtr = macAddressFilterData.droppedPacketCount[mode];
  *totalPacketCountPtr   = macAddressFilterData.totalPackets;
}

// <generate-cli-xml> Command: plugin mac-address-filtering clear-stats
// <generate-cli-xml> Description:  Clears all packet counts for all modes.  Leaves config and lists intact.

void emberAfPluginMacAddressFilteringClearStats(SL_CLI_COMMAND_ARG)
{
  clearStatsForFilterType(MAC_FILTER_TYPE_NO_ADDRESS);
  clearStatsForFilterType(MAC_FILTER_TYPE_SHORT_ADDRESS);
  clearStatsForFilterType(MAC_FILTER_TYPE_LONG_ADDRESS);
  clearStatsForFilterType(MAC_FILTER_TYPE_PAN_ID);
}
